[
    {
        "date": "Oct 2025 - Present",
        "role": "AI Engineer",
        "company": "LumerAI - Hybrid, Egypt",
        "responsibilities": [
            "Utilized and optimized advanced models for enhanced inference capabilities.",
            "Applied effective techniques in prompt engineering and data preparation to improve model performance.",
            "Engineered and deployed innovative AI solutions within a specific domain.",
            "Troubleshot and resolved issues in existing AI systems.",
            "Ensured scalability and maintainability through clean and robust software design.",
            "Developed core AI models, addressed system issues, and ensured robustness through validation and testing.",
            "Collaborated with cross-functional teams to deliver impactful features through regular releases."
        ]
    },
    {
        "date": "Feb 2021 - Dec 2025",
        "role": "Android Developer",
        "company": "Freelance - Remote, Singapore",
        "responsibilities": [
            "Developed Android applications with focus on performance, scalability, and adaptability",
            "Troubleshot and resolved bugs, improving stability and increasing crash-free rate from 95% to 98%",
            "Ensured robustness through unit testing, achieving approximately 65% test coverage",
            "Collaborated with cross-functional teams, delivering impactful features through bi-weekly releases",
            "Designed and implemented major long-term features ensuring stability and scalability"
        ]
    },
    {
        "date": "Aug 2023 - Oct 2023",
        "role": "Data Scientist Intern",
        "company": "Vodafone - Hybrid, Egypt",
        "responsibilities": [
            "Conducted time series forecasting and analysis for master's graduation project",
            "Worked with real datasets, performing data cleaning and preprocessing",
            "Applied statistical models and ML algorithms to analyze historical data and predict trends",
            "Developed and deployed a time series forecasting pipeline",
            "Presented statistical analysis and findings using visualizations"
        ]
    },
    {
        "date": "Nov 2022 - Oct 2023",
        "role": "Data Scientist Intern",
        "company": "Digital Egypt Builders Initiative (DEBI) - Egypt",
        "responsibilities": [
            "Developed rigorous understanding of fundamental concepts in Data Science and ML",
            "Designed and executed processes for modeling complex systems and collecting data",
            "Designed, evaluated, and refined data-driven solutions and infrastructure",
            "Developed understanding of ethical, security, and privacy implications of data solutions"
        ]
    }
]